{
  "slug": "form-8-filings",
  "title": "Form 8 Filings",
  "sections": [
    {
      "heading": "Filing Form 8: LLP Statement of Accounts and Solvency (MCA)",
      "content": [
        "You can fill in Form 8 online and stay in line with LLP rules. Stay out of trouble with the law and avoid fines.",
        "Every year, all Limited Liability Partnerships (LLPs) in India must file Form 8 with the Ministry of Corporate Affairs (MCA). This is where they send their Statement of Accounts and Solvency.",
        "Compliance experts will help you file your Form 8 quickly and correctly."
      ]
    },
    {
      "heading": "What does it mean to file Form 8?",
      "content": [
        "Under Section 34 of the LLP Act, 2008, Form 8 is the Annual Return for LLP financials. It has:"
      ],
      "list": [
        {
          "points": [
            "The LLP's financial statements",
            "Certification of solvency by chosen partners",
            "Confirmation of compliance with the LLP agreement",
            "Filing Form 8 keeps your LLP legal and open to the public."
          ]
        }
      ]
    },
    {
      "heading": "Who Needs to Fill Out Form 8?",
      "list": [
        {
          "points": [
            "All Limited Liability Partnerships (LLPs) that are registered in India",
            "LLPs that are currently active or inactive",
            "LLPs that don't make any money or have no turnover",
            "Form 8 must be filed every year, even if the LLP is not active."
          ]
        }
      ]
    },
    {
      "heading": "When is Form 8 due?",
      "content": [
        "30 days after the end of the 6-month financial year",
        "Example: If the fiscal year ends on March 31, Form 8 is due by October 30.",
        "Filing late will cost you a lot of money in MCA fines."
      ]
    },
    {
      "heading": "Late filing of Form 8: Penalty",
      "list": [
        {
          "points": [
            "₹100 late fee every day (no limit)",
            "LLP and its partners could be sued",
            "MCA marked LLP as not in compliance",
            "It's very important to file Form 8 on time to avoid fines."
          ]
        }
      ]
    },
    {
      "heading": "Things You Need to File Form 8",
      "list": [
        {
          "points": [
            "Statement of Account and Solvency",
            "Audited financial statements (if needed)",
            "Details of the LLP Agreement",
            "Digital signatures of designated partners"
          ]
        }
      ]
    },
    {
      "heading": "Why It's Important to File Form 8",
      "list": [
        {
          "points": [
            "Required every year for LLPs",
            "Keeps MCA happy",
            "Avoids fines and legal notices",
            "Necessary for loans, GST, or business credibility"
          ]
        }
      ]
    },
    {
      "heading": "Why Should You Choose Us to File Form 8?",
      "list": [
        {
          "points": [
            "Support for LLP compliance from experts",
            "100% correct and in line with MCA",
            "Reminders on time and a simple process",
            "Prices that are easy on the wallet",
            "LLPs all over India trust us"
          ]
        }
      ]
    },
    {
      "heading": "Form 8 Filing FAQs",
      "list": [
        {
          "title": "Does an LLP with no business have to fill out Form 8?",
          "points": [
            "Yes. Even if they don't make any money, all LLPs have to file Form 8 every year."
          ]
        },
        {
          "title": "Can you file Form 8 online?",
          "points": [
            "Yes. You can send Form 8 electronically through the MCA portal using the partner DSC."
          ]
        },
        {
          "title": "What happens if you don't file Form 8?",
          "points": [
            "If you file late, you'll have to pay a fine every day, and LLP may be marked as non-compliant, which could lead to legal action."
          ]
        },
        {
          "title": "Do you need to do an audit to file Form 8?",
          "points": [
            "Yes, if the LLP's turnover is more than ₹40 lakh or its contribution is more than ₹25 lakh, as the LLP Act says."
          ]
        }
      ]
    }
  ]
}
