{
  "slug": "form-11-filings",
  "title": "Form 11 Filings",
  "sections": [
    {
      "heading": "Filing Form 11: LLP Annual Return (MCA)",
      "content": [
        "Fill out Form 11 online to stay in line with LLP rules. Avoid being fined or getting legal notices.",
        "All Limited Liability Partnerships (LLPs) in India must file Form 11 every year to send their Annual Return to the Ministry of Corporate Affairs (MCA).",
        "Compliance experts will quickly and correctly file your Form 11."
      ]
    },
    {
      "heading": "What does it mean to file Form 11?",
      "content": [
        "Section 92 of the LLP Act, 2008 says that LLPs must file Form 11 every year. It has:"
      ],
      "list": [
        {
          "points": [
            "Information about partners and what they do",
            "Changes in partners or partners who are supposed to be partners",
            "LLP's main business activities and registered office",
            "Statement saying that the LLP agreement has been followed",
            "Filing Form 11 keeps your LLP in line with the law and up to date with MCA records."
          ]
        }
      ]
    },
    {
      "heading": "Who Needs to File Form 11?",
      "list": [
        {
          "points": [
            "All LLPs that are registered in India",
            "LLPs that are still open or closed",
            "LLPs that don't do any business or have no turnover",
            "Every year, all LLPs must file, no matter what they do."
          ]
        }
      ]
    },
    {
      "heading": "Due Date for Form 11",
      "content": [
        "Within 60 days of the end of the fiscal year",
        "For example, Form 11 is due by May 30 for the fiscal year that ends on March 31.",
        "If you file late, you will have to pay MCA fines."
      ]
    },
    {
      "heading": "Late Filing of Form 11 Penalty",
      "list": [
        {
          "points": [
            "₹100 late fee every day (no limit)",
            "LLP and its partners could be sued",
            "MCA may mark LLP as not compliant",
            "Filing Form 11 on time keeps you from getting fines and having to go to court."
          ]
        }
      ]
    },
    {
      "heading": "Things you need to file Form 11",
      "list": [
        {
          "points": [
            "Details about the LLP Agreement",
            "Information about partners' contributions",
            "Changes to the designated partners (if there are any)",
            "Digital signatures from the right partners"
          ]
        }
      ]
    },
    {
      "heading": "Why It's Important to File Form 11",
      "list": [
        {
          "points": [
            "Required yearly compliance for LLPs",
            "Keeps MCA records up to date",
            "Avoids fines and legal notices",
            "Necessary for loans, GST registration, or credibility"
          ]
        }
      ]
    },
    {
      "heading": "Questions and Answers About Filing Form 11",
      "list": [
        {
          "title": "Do LLPs that don't do business have to fill out Form 11?",
          "points": [
            "Yes. Every year, all LLPs must file Form 11, even if they don't have any business or sales."
          ]
        },
        {
          "title": "Is it possible to file Form 11 online?",
          "points": [
            "Yes. You can send Form 11 electronically through the MCA portal with the right partner DSC."
          ]
        },
        {
          "title": "What happens if you don't file Form 11?",
          "points": [
            "If you file late, you will have to pay a fine every day, and the LLP may be marked as not compliant, which could lead to legal action."
          ]
        },
        {
          "title": "Is Form 11 connected to Form 8?",
          "points": [
            "Yes. LLPs must file Form 11 (Annual Return) and Form 8 (Statement of Accounts & Solvency) every year."
          ]
        }
      ]
    },
    {
      "heading": "Why Should You Choose Us to File Form 11?",
      "list": [
        {
          "points": [
            "Help with LLP compliance from experts",
            "100% filing that follows the MCA",
            "Reminders on time and a process that is easy to follow",
            "Prices that are easy on the wallet",
            "LLPs all over India trust us"
          ]
        }
      ]
    }
  ]
}
