{
  "slug": "mgt-7-filings",
  "title": "MGT-7 Filings",
  "sections": [
    {
      "heading": "Filing MGT-7: Annual Return with ROC (MCA)",
      "content": [
        "You can file MGT-7 online and be fully compliant with the Companies Act, 2013. Stay away from penalties and ROC notices.",
        "MGT-7 is a required ROC filing that includes a company's Annual Return, which has information about its shareholders, directors, and other important company information.",
        "Compliance experts will file your MGT-7 quickly and correctly."
      ]
    },
    {
      "heading": "What does it mean to file MGT-7?",
      "content": [
        "The Companies Act of 2013, Section 92, says that MGT-7 is the Annual Return form that must be filled out. It has:"
      ],
      "list": [
        {
          "points": [
            "The company's pattern of ownership",
            "Information about the director and the DIN",
            "Changes in how the company is run or how it is set up",
            "How many meetings the Board has held",
            "Filing MGT-7 makes sure that MCA can see everything that happens in the company."
          ]
        }
      ]
    },
    {
      "heading": "Who Has to File MGT-7?",
      "list": [
        {
          "points": [
            "Companies with limited liability",
            "Companies with limited liability and one person (OPC)",
            "LLPs don't file MGT-7"
          ]
        }
      ]
    },
    {
      "heading": "When is MGT-7 due?",
      "content": [
        "Within 60 days of the Annual General Meeting (AGM)",
        "Late filing comes with MCA fines."
      ]
    },
    {
      "heading": "Fine for Filing MGT-7 Late",
      "list": [
        {
          "points": [
            "₹1,00,000 fine for the company",
            "₹25,000 fine for each director",
            "MCA marked the company as not in compliance",
            "If you file on time, you won't get fines or legal notices."
          ]
        }
      ]
    },
    {
      "heading": "What You Need to File MGT-7",
      "list": [
        {
          "points": [
            "Board Resolution approving Annual Return",
            "Information about Directors, Shareholders, and Shareholding",
            "AGM minutes",
            "Auditor's report (if necessary)"
          ]
        }
      ]
    },
    {
      "heading": "Why it's important to file MGT-7",
      "list": [
        {
          "points": [
            "Required every year",
            "Keeps ROC records up to date",
            "Avoids fines and legal trouble",
            "Increases the company's credibility"
          ]
        }
      ]
    },
    {
      "heading": "Why should you choose us to file your MGT-7?",
      "list": [
        {
          "points": [
            "Help with filing your MCA from experts",
            "Timely submission and reminders",
            "100% error-free submissions",
            "Prices that are reasonable",
            "Startups, small and medium-sized businesses, and large companies all trust us."
          ]
        }
      ]
    },
    {
      "heading": "Questions and Answers about MGT-7 Filing",
      "list": [
        {
          "title": "Do you have to file MGT-7 every year?",
          "points": [
            "Yes, every year within 60 days of the AGM, all companies must file MGT-7."
          ]
        },
        {
          "title": "Is it possible to file MGT-7 online?",
          "points": [
            "Yes. You can file MGT-7 online at the MCA portal."
          ]
        },
        {
          "title": "What will happen if MGT-7 isn't filed?",
          "points": [
            "The company and its directors could be fined, and the company could be marked as not following the rules."
          ]
        },
        {
          "title": "Does MGT-7 apply to OPCs and private limited companies?",
          "points": [
            "Yes, every OPC and private limited company must file MGT-7."
          ]
        }
      ]
    }
  ]
}
